<a href="https://colab.research.google.com/github/Sorin9202/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/%ED%8C%AC%EB%8D%94%EC%8A%A4_%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D_%EA%B8%B0%EC%B4%88_%EC%8B%A4%EC%8A%B5_1~6_(2020_07_23)_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [36]:
 import pandas as pd

## 1) 팬더스, 데이터프레임, 시리즈 알아보기

In [2]:
list_tmp = [1,2,3]

In [3]:
list_tmp

[1, 2, 3]

In [4]:
s1 = pd.core.series.Series([1,2,3])

In [5]:
s2 = pd.core.series.Series(['one','two','three'])

In [6]:
pd.DataFrame(data=dict(num=s1, word=s2)) #데이터프레임 생성

   num   word
0    1    one
1    2    two
2    3  three

In [8]:
!conda list | grep pandas

/bin/bash: conda: command not found

## 2) 파일에서 데이터 불러오기

In [9]:
df = pd.read_csv('data/friend_list.csv')

In [10]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [11]:
df.head() #처음부터 다섯 번째까지를 보여준다(숫자를 지정하면 그 순서까지)

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [12]:
df.tail() #뒤에서부터 가져온다.

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
df = pd.read_csv('data/friend_list.txt')

In [14]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [17]:
#쉼표 구분이 아니라 TAB으로 구분한다면?

df = pd.read_csv('data/friend_list_tab.txt')

In [18]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [19]:
#데이터가 잘못된 걸 확인할 수 있음. tab이 데이터 안에 들어가있음. Pandas가 comma가 아닌 tab으로 구분된 데이터를 파악할 수 있도록 얄려줘야 함.

In [21]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter='\t')

In [22]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [23]:
#이제는 헤더 정보가 없는 (name,age,job와 같은 column의 이름이 없음) 파일로 실습

In [24]:
df = pd.read_csv('data/friend_list_no_head.csv')

In [25]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [26]:
#첫번째 있는 행이 column 네임으로 들어가버럼. 그래서 head가 없다는 걸 얄려줘야 함.

In [27]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [28]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [30]:
#column name을 넣어주고 싶을때.

df.columns = ['name', 'age', 'job']

In [31]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [34]:
 df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [35]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## 3) 데이터프레임 생성하기 -  Create DataFrame from your python code

In [37]:
friend_dict_list = [
                    {'name': 'John', 'age': 25, 'job': 'Postgrad'},
                    {'name': 'Emily', 'age': 35, 'job': 'Orthodonist'}
]

In [38]:
df = pd.DataFrame(friend_dict_list)

In [39]:
df

    name  age          job
0   John   25     Postgrad
1  Emily   35  Orthodonist

In [41]:
#dictionary의 경우 key의 순서의 값이 보장되지 않음. 그렇기 때문에 순서를 보정해야하는 단점이 있음.

df = df[['name', 'age', 'job']]

In [42]:
df.head()

    name  age          job
0   John   25     Postgrad
1  Emily   35  Orthodonist

In [43]:
from collections import OrderedDict

In [44]:
friend_ordered_dict = OrderedDict(
    [
     ('name', ['John','Emily','Jessica','Michael']),
     ('age', [25, 35, 31, 29]),
     ('job', ['Postgrad','Orthodonist','Financial Manager','Web Developer'])
    ]
)

In [45]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [46]:
df.head()

      name  age                job
0     John   25           Postgrad
1    Emily   35        Orthodonist
2  Jessica   31  Financial Manager
3  Michael   29      Web Developer

In [47]:
friend_list = [
               ['John', 25, 'Postgrad'],
               ['Emily', 35, 'Orthodonist'],
               ['Jessica', 31, 'Financial Manager'],
               ['Michael', 29, 'Web Developer'],
]

In [48]:
column_name = ['name', 'age', 'job'] #friend_list에 대한 헤더

In [49]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [50]:
df.head()

      name  age                job
0     John   25           Postgrad
1    Emily   35        Orthodonist
2  Jessica   31  Financial Manager
3  Michael   29      Web Developer

In [51]:
#colums 따로 지정 안해주고 한번에 설정
friend_list = [
               ['name',['John', 'Emily', 'Jessica', 'Michael', 'Alexis']],
               ['age',[25, 35, 31, 29, 21]],
               ['job',['postgrad', 'orthodonist', 'financial manager', 'web developer', 'student']]
]

In [52]:
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [53]:
df.head()

      name  age                job
0     John   25           postgrad
1    Emily   35        orthodonist
2  Jessica   31  financial manager
3  Michael   29      web developer
4   Alexis   21            student

## 4 ) 데이터프레임 파일로 저장하기(to_csv)

In [54]:
import pandas as pd

In [56]:
friends = [{'name': 'Daniel', 'age': 31, 'job': 'dental hygienist'},
           {'name': 'Michelle', 'age': 38, 'job': 'surgeon'},
           {'name': 'Haley', 'age': 24, 'job': None}]
df = pd.DataFrame(friends)
df = df[['name','age','job']]

In [57]:
df.head()

       name  age               job
0    Daniel   31  dental hygienist
1  Michelle   38           surgeon
2     Haley   24              None

In [59]:
#dataframe을 csv 파일로 저장

df.to_csv('friends.csv', index = True, header = True) #팬더스 데이터분석 기초 실습.ipynb가 있는 위치와 같은 위치에 생성된다.
#index = True, header = True는 디폴트로 설정되어 있다.
#row id (0,1,2)fmf 생략하고 싶다면 index = False 로 설정
#header = False로 설정하면 name, age, job이 포함된 헤더가 사라진다.

In [60]:
df.to_csv('friends.csv', index = False, header = False, na_rep = '-')
#na_rep = '-' : None Value는 - 로 바꿔서 넣어라.

## 5) 데이터프레임 행, 열(row, column) 선택 및 필터하기 - Select, Filter Rows or Columns

In [61]:
import pandas as pd

In [63]:
friend_list = [
               ['name', ['Nathan', 'Amber', 'Timothy']],
               ['age', [28, 30, 25]],
               ['job', ['staff accountant', 'software engineer', 'student']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [64]:
df

      name  age                job
0   Nathan   28   staff accountant
1    Amber   30  software engineer
2  Timothy   25            student

In [65]:
 #특정 인덱스만 원하는 경우
 df[1:3]

      name  age                job
1    Amber   30  software engineer
2  Timothy   25            student

In [66]:
#불연속적인 데이터 원할 경우(0,2번)

df.loc[[0,2]]

      name  age               job
0   Nathan   28  staff accountant
2  Timothy   25           student

### by column condition

데이터 프레임 중에서 특정 조건을 가진 인덱스를 원할 때

In [67]:
df[df.age>25]

     name  age                job
0  Nathan   28   staff accountant
1   Amber   30  software engineer

In [68]:
df.query('age>25')

     name  age                job
0  Nathan   28   staff accountant
1   Amber   30  software engineer

In [69]:
df

      name  age                job
0   Nathan   28   staff accountant
1    Amber   30  software engineer
2  Timothy   25            student

In [70]:
#나이가 25살 이상이고 이름이 'Amber'인 사람

df[(df.age>25)&(df.name=='Amber')]

    name  age                job
1  Amber   30  software engineer

### filter Column

#### by index

In [72]:
friend_list = [
               ['Nicole',32,'physical therapist'],
               ['Eric',30,'travel agent'],
               ['Hannah',30,'statistician'],
               ['Jordan',27,'photographer'],
               ['Matthew',40,'art director'],
               ['Kristin',43,'building consultant']
]
df = pd.DataFrame.from_records(friend_list)

In [73]:
df

         0   1                    2
0   Nicole  32   physical therapist
1     Eric  30         travel agent
2   Hannah  30         statistician
3   Jordan  27         photographer
4  Matthew  40         art director
5  Kristin  43  building consultant

In [74]:
 df.iloc[:,0:2] # :,0:2 앞부분은 행을 말함. :는 모두 다 불러오겠다는 뜻.
 # 뒤의 0:2는 column을 뜻함.

         0   1
0   Nicole  32
1     Eric  30
2   Hannah  30
3   Jordan  27
4  Matthew  40
5  Kristin  43

In [75]:
# row와 col 모두 0번부터 1번까지 구하고 싶은 경우

df.iloc[0:2,0:2]

        0   1
0  Nicole  32
1    Eric  30

### by column name

데이터 프레임 중에서 특정 조건을 가진 인덱스를 이름을 통해 가져옴

In [78]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [79]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [81]:
df_filtered = df[['name','age']] #방법 1

In [82]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [83]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [84]:
df.filter(items=['age','job']) #방법 2. filter 함수 사용

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [85]:
#colmun name에 'a'가 들어가는 header의 value만 얻고 싶을 때
df.filter(like='a', axis=1) #colmun의 축(axis)은 1이다.

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [86]:
#regex 사용
df.filter(regex='b') #colmun 네임이 b 로 끝나는 것만 얻고 싶음

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

## 6) 데이터프레임 행, 열 삭제하기 - Drop row or column

In [88]:
import pandas as pd

friends = [{'age':15,'job':'student'},
           {'age':33,'job':'developer'},
           {'age':29,'job':'teacher'}]
df = pd.DataFrame(friends, index=['Madison','Sean','Jenna'], columns = ['age', 'job'])
df

         age        job
Madison   15    student
Sean      33  developer
Jenna     29    teacher

In [90]:
#Madision과 Jenna 의 정보를 없애고 싶은 경우
df.drop(['Madison','Jenna'])

      age        job
Sean   33  developer

In [92]:
#데이터 프레임에는 아직까지 남아있으므로 없애고 싶다면 직접 지정해야 함
df = df.drop(['Madison','Jenna'])

In [93]:
df

      age        job
Sean   33  developer

In [94]:
df = pd.DataFrame(friends, index=['Madison','Sean','Jenna'], columns = ['age', 'job'])
df

         age        job
Madison   15    student
Sean      33  developer
Jenna     29    teacher

In [95]:
#drop 시 inplae = True 로 설정하면 원 dataframe에 반영됨
df.drop(['Madison','Sean'], inplace = True)
df

       age      job
Jenna   29  teacher

In [97]:
#실제로는 index가 0,1,2와 같은 번호로 들어가는 경우가 많음.

friends = [{'name':'Madison','age':15,'job':'student'},
           {'name':'Sean','age':33,'job':'developer'},
           {'name':'Jenna','age':29,'job':'teacher'}]
df = pd.DataFrame(friends, columns = ['name','age', 'job'])
df

      name  age        job
0  Madison   15    student
1     Sean   33  developer
2    Jenna   29    teacher

In [99]:
 #이런 경우 Madison 과 Jenna를 삭제하는 방법(인덱스 이용)

 df = df.drop(df.index[[0,2]])
 df

   name  age        job
1  Sean   33  developer

In [100]:
df = pd.DataFrame(friends, columns = ['name','age', 'job'])
df

      name  age        job
0  Madison   15    student
1     Sean   33  developer
2    Jenna   29    teacher

In [101]:
# 특정 조건의 value 삭제함.

df = df[df.age > 20]
df

    name  age        job
1   Sean   33  developer
2  Jenna   29    teacher

In [102]:

df = pd.DataFrame(friends, columns = ['name','age', 'job'])
df

      name  age        job
0  Madison   15    student
1     Sean   33  developer
2    Jenna   29    teacher

In [103]:
# colmun 삭제

df = df.drop('age', axis=1) #colmun 중에서 'age'를 drop
df

      name        job
0  Madison    student
1     Sean  developer
2    Jenna    teacher

In [104]:
df = pd.DataFrame(friends, columns = ['name','age', 'job'])
df

      name  age        job
0  Madison   15    student
1     Sean   33  developer
2    Jenna   29    teacher

In [105]:
df.drop('age', axis = 1, inplace = True)
df

      name        job
0  Madison    student
1     Sean  developer
2    Jenna    teacher